results/ab.out
===========================================================================
WARM-UP
$ ./ab.exe -n 2000 -c 4 -l http://localhost:8771/feignshop/orderPizza/
This is ApacheBench, Version 2.3 <$Revision: 1826891 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 200 requests
Completed 400 requests
Completed 600 requests
Completed 800 requests
Completed 1000 requests
Completed 1200 requests
Completed 1400 requests
Completed 1600 requests
Completed 1800 requests
Completed 2000 requests
Finished 2000 requests


Server Software:
Server Hostname:        localhost
Server Port:            8771

Document Path:          /feignshop/orderPizza/
Document Length:        Variable

Concurrency Level:      4
Time taken for tests:   14.441 seconds
Complete requests:      2000
Failed requests:        0
Total transferred:      430419 bytes
HTML transferred:       204419 bytes
Requests per second:    138.49 [#/sec] (mean)
Time per request:       28.882 [ms] (mean)
Time per request:       7.221 [ms] (mean, across all concurrent requests)
Transfer rate:          29.11 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    1   0.6      1      21
Processing:     5   27  25.6     19     227
Waiting:        5   27  25.6     18     227
Total:          6   29  25.7     20     228

Percentage of the requests served within a certain time (ms)
  50%     20
  66%     27
  75%     34
  80%     40
  90%     59
  95%     78
  98%    109
  99%    137
 100%    228 (longest request)

===========================================================================
REAL MEASUREMENTS
$ ./ab.exe -n 5000 -c 4 -l http://localhost:8771/feignshop/orderPizza/
This is ApacheBench, Version 2.3 <$Revision: 1826891 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:
Server Hostname:        localhost
Server Port:            8771

Document Path:          /feignshop/orderPizza/
Document Length:        Variable

Concurrency Level:      4
Time taken for tests:   20.265 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      1075907 bytes
HTML transferred:       510907 bytes
Requests per second:    246.73 [#/sec] (mean)
Time per request:       16.212 [ms] (mean)
Time per request:       4.053 [ms] (mean, across all concurrent requests)
Transfer rate:          51.85 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    1   0.8      1      33
Processing:     3   15  24.3      9     557
Waiting:        3   15  24.3      8     557
Total:          4   16  24.4     10     558

Percentage of the requests served within a certain time (ms)
  50%     10
  66%     12
  75%     15
  80%     18
  90%     28
  95%     47
  98%     81
  99%    122
 100%    558 (longest request)